{
    "en": {
        "welcome" : "Welcome to my loan calculator!",
        "ask_loan_amount" : "How much is your loan? Please use this format: 100000",
        "invalid_number" : "You didn't enter a valid input type. Please try again!",
        "no_zeros" : "Sorry, we can't have you enter 0 for the loan amount or loan duration in years. Please try again.",
        "ask_apr" : "What is your annual percentage rate? Please use this format: 2.5 for 2.5% or 5 for 5%",
        "ask_year" : "How long does your loan last in years (and months, if applicable)? Please use whole numbers and enter the amount of years first.",
        "ask_months" : "How many additional months does your loan last? Please use whole numbers.",
        "state_numbers" : "Okay, so we have a loan in the amount of ${loan_amount:,.2f} with an APR of {apr}% and it lasts for {loan_duration_years} year(s) and {loan_duration_months} month(s). Let me make my calculations.",
        "no_interest" : "Oh, I see there is no interest - Nice! Let me adjust for that.",
        "calc_error" : "There was an error in the calculation.",
        "result" : "Okay, your monthly payment will be ${monthly_payment:,.2f} per month.",
        "another_calculation" : "Would you like to calculate another monthly payment? Type Y for Yes and N for No:",
        "preference_choice" : "You didn't select either of the correct options. Please try again!",
        "end_of_program" : "Thanks for using my loan calculator! Have a nice day!"
    },

    "es": {
        "welcome" : "¡Bienvenido a mi calculadora de prestamos!",
        "ask_loan_amount" : "¿Cuánto es su préstamo? Utilice este formato: 100000",
        "invalid_number" : "No has introducido un tipo de entrada válido. ¡Por favor, inténtalo de nuevo!",
        "no_zeros" : "Lo sentimos, no podemos permitirle ingresar 0 como monto o duración del préstamo. Por favor, inténtelo nuevamente.",
        "ask_apr" : "¿Que es su tasa de interés anual? Por favor utilice este formato: 2.5 para 2.5% o 5 para 5%",
        "ask_year" : "¿Cuánto tiempo dura su préstamo en años (y meses, si corresponde)? Use números enteros y introduce primero la cantidad de años.",
        "ask_months" : "¿Cuántos meses adicionales le quedan del préstamo? Por favor, utilice números enteros.",
        "state_numbers" : "Bueno, tenemos un préstamo por un monto de ${loan_amount:,.2f} con una TAE de {apr}% y una duración de {loan_duration_years} años. Déjame hacer mis cálculos.",
        "no_interest" : "Ah, ya veo que no hay interés. ¡Genial! Déjame hacer los ajustes necesarios.",
        "calc_error" : "Hubo un error en el cálculo.",
        "result" : "Bueno, su pago mensual será ${monthly_payment:,.2f} cada mes.",
        "another_calculation" : "¿Desea calcular otro pago mensual? Escriba Y para Sí y N para No:",
        "preference_choice" : "No has seleccionado ninguna de las opciones correctas. ¡Por favor, inténtalo de nuevo!",
        "end_of_program" : "¡Gracias por usar mi calculadora de prestamos! ¡Que tengas un buen día!"
    }
}